src/test/resources/directpayment/doReset/doResetRequestFull.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:doResetRequest xmlns="http://obj.ws.payline.experian.com" xmlns:ns2="http://impl.ws.payline.experian.com">
            <ns2:version>99</ns2:version>
            <ns2:transactionID>TrsIdyyyy</ns2:transactionID>
            <ns2:comment>Commentbbbb</ns2:comment>
            <ns2:media>media pc</ns2:media>
            <ns2:amount>100</ns2:amount>
            <ns2:currency>978</ns2:currency>
            <ns2:privateDataList>
                <privateData>
                    <key>pvDataKey</key>
                    <value>pvDataValue</value>
                </privateData>
            </ns2:privateDataList>
            <ns2:sequenceNumber>sequence number 111</ns2:sequenceNumber>
        </ns2:doResetRequest>
    </S:Body>
</S:Envelope>